In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)  #this is to generate same random numbers everytime

In [32]:
df= pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [33]:
df #each column is a series

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [34]:
df['W']

A   -0.156598
B   -0.610259
C   -0.479448
D    1.862864
E    2.084019
Name: W, dtype: float64

In [35]:
type(df['W'])

pandas.core.series.Series

In [36]:
type(df)

pandas.core.frame.DataFrame

In [37]:
df[['W','Z']] #when we want to use multiple columns, we should give list of columns insife df (two brackets)

          W         Z
A -0.156598  2.154846
B -0.610259  0.147027
C -0.479448 -0.925874
D  1.862864  0.386030
E  2.084019  0.681209

In [38]:
#when we ask a single column we get a series and when we ask multiple columns we ger a dataframe

In [39]:
#creating a new column
df['new'] = df['W'] + df['Y']

In [40]:
df

          W         X         Y         Z       new
A -0.156598 -0.031579  0.649826  2.154846  0.493228
B -0.610259 -0.755325 -0.346419  0.147027 -0.956677
C -0.479448  0.558769  1.024810 -0.925874  0.545362
D  1.862864 -1.133817  0.610478  0.386030  2.473342
E  2.084019 -0.376519  0.230336  0.681209  2.314355

In [41]:
df.drop('new',axis = 1)
#for drop method by default there is a axis = 0, which looks for the index 'new' here, but we are trying to drop a 'new' column, hence give axis=1

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [42]:
df #we still have new column

          W         X         Y         Z       new
A -0.156598 -0.031579  0.649826  2.154846  0.493228
B -0.610259 -0.755325 -0.346419  0.147027 -0.956677
C -0.479448  0.558769  1.024810 -0.925874  0.545362
D  1.862864 -1.133817  0.610478  0.386030  2.473342
E  2.084019 -0.376519  0.230336  0.681209  2.314355

In [43]:
#we should specify inplace =  True
df.drop('new',axis = 1, inplace = True)

In [44]:
df

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [45]:
#now let's drop rows
df.drop('E')

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030

In [46]:
df

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [47]:
df.drop('E')

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030

In [48]:
df

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [49]:
df.shape  #here (5,4) is a tuple. Shape shows there are 5 rows and 4 columns in the df, hence axis=0 for rows and 1 for columns

(5, 4)

In [50]:
df

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [51]:
#while selecting columns we just pass a column name or a list of columns to the df object.
#now lets talk about selecting ROWS

In [52]:
df

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [53]:
#there are two methods to select a row in a dataframe
df.loc['A']

W   -0.156598
X   -0.031579
Y    0.649826
Z    2.154846
Name: A, dtype: float64

In [54]:
#here the row is a series too as columns

In [55]:
df.iloc[0] #this also returns the row A. iloc is index location

W   -0.156598
X   -0.031579
Y    0.649826
Z    2.154846
Name: A, dtype: float64

In [56]:
#selecting subsets of rows and columns

In [57]:
df.loc['B','Y']

-0.34641850351854453

In [60]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.156598  0.649826
B -0.610259 -0.346419

In [61]:
df

          W         X         Y         Z
A -0.156598 -0.031579  0.649826  2.154846
B -0.610259 -0.755325 -0.346419  0.147027
C -0.479448  0.558769  1.024810 -0.925874
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [62]:
#conditionalselection

In [65]:
booldf = df > 0

In [66]:
booldf

       W      X      Y      Z
A  False  False   True   True
B  False  False  False   True
C  False   True   True  False
D   True  False   True   True
E   True  False   True   True

In [67]:
df[booldf]

          W         X         Y         Z
A       NaN       NaN  0.649826  2.154846
B       NaN       NaN       NaN  0.147027
C       NaN  0.558769  1.024810       NaN
D  1.862864       NaN  0.610478  0.386030
E  2.084019       NaN  0.230336  0.681209

In [68]:
#or

In [70]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.649826  2.154846
B       NaN       NaN       NaN  0.147027
C       NaN  0.558769  1.024810       NaN
D  1.862864       NaN  0.610478  0.386030
E  2.084019       NaN  0.230336  0.681209

In [72]:
df[df['W']>0] #here we are selecting the rows where column W values are >0. rest of the rows will not be shown

          W         X         Y         Z
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [74]:
#practice
#same thing with column 'Z'
df[df['Z']<0]

          W         X        Y         Z
C -0.479448  0.558769  1.02481 -0.925874

In [75]:
#we can save this subst of dataframe to a new dataframe and do the same operations
resultdf = df[df['W']>0]

In [76]:
resultdf

          W         X         Y         Z
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [77]:
#now I want 'X' column from resultdf
resultdf['X']

D   -1.133817
E   -0.376519
Name: X, dtype: float64

In [83]:
#we can do this in one step
df[df['W']>0]['X']

D   -1.133817
E   -0.376519
Name: X, dtype: float64

In [84]:
#now similarly lets grab two columns, remember we are passing a list of column headings
df[df['W']>0][['X','Y']]

          X         Y
D -1.133817  0.610478
E -0.376519  0.230336

In [87]:
#which is similar to
boolser = df['W']>0
result = df[boolser]
mycols = ['X','Y']
result[mycols]

          X         Y
D -1.133817  0.610478
E -0.376519  0.230336

In [89]:
#multiple conditions
df[(df['W']>0) & (df['Y']<1)]

          W         X         Y         Z
D  1.862864 -1.133817  0.610478  0.386030
E  2.084019 -0.376519  0.230336  0.681209

In [90]:
#resetting index

In [91]:
df.reset_index() #now the index is a column and actual index is numerical values

  index         W         X         Y         Z
0     A -0.156598 -0.031579  0.649826  2.154846
1     B -0.610259 -0.755325 -0.346419  0.147027
2     C -0.479448  0.558769  1.024810 -0.925874
3     D  1.862864 -1.133817  0.610478  0.386030
4     E  2.084019 -0.376519  0.230336  0.681209

In [92]:
newind = 'CA NY WY OR CO'.split()

In [93]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [94]:
df['States']=newind

In [95]:
df

          W         X         Y         Z States
A -0.156598 -0.031579  0.649826  2.154846     CA
B -0.610259 -0.755325 -0.346419  0.147027     NY
C -0.479448  0.558769  1.024810 -0.925874     WY
D  1.862864 -1.133817  0.610478  0.386030     OR
E  2.084019 -0.376519  0.230336  0.681209     CO

In [97]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.156598 -0.031579  0.649826  2.154846
NY     -0.610259 -0.755325 -0.346419  0.147027
WY     -0.479448  0.558769  1.024810 -0.925874
OR      1.862864 -1.133817  0.610478  0.386030
CO      2.084019 -0.376519  0.230336  0.681209

In [98]:
df

          W         X         Y         Z States
A -0.156598 -0.031579  0.649826  2.154846     CA
B -0.610259 -0.755325 -0.346419  0.147027     NY
C -0.479448  0.558769  1.024810 -0.925874     WY
D  1.862864 -1.133817  0.610478  0.386030     OR
E  2.084019 -0.376519  0.230336  0.681209     CO